01-A1/prism/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (33 0 0)
    (40 0 0)
    (100 0 0)
    (0 8 0)
    (33 8 0)
    (40 8 0)
    (100 8 0)
    (0 40 0)
    (36 40 0)
    (40 38 0)
    (100 38 0)
    (40 42 0)
    (100 42 0)
    (0 72 0)
    (33 72 0)
    (40 72 0)
    (100 72 0)
    (0 80 0)
    (33 80 0)
    (40 80 0)
    (100 80 0)
    (0 0 8)
    (33 0 8)
    (40 0 8)
    (100 0 8)
    (0 8 8)
    (33 8 8)
    (40 8 8)
    (100 8 8)
    (0 40 8)
    (36 40 8)
    (40 38 8)
    (100 38 8)
    (40 42 8)
    (100 42 8)
    (0 72 8)
    (33 72 8)
    (40 72 8)
    (100 72 8)
    (0 80 8)
    (33 80 8)
    (40 80 8)
    (100 80 8)
    
);

blocks
(
    hex (0 1 5 4 22 23 27 26) (32 8 1) simpleGrading (0.2 1 1)
    hex (4 5 9 8 26 27 31 30) (32 32 1) simpleGrading (0.2 0.2 1)
    hex (5 6 10 9 27 28 32 31) (32 32 1) simpleGrading (1 0.2 1)
    hex (1 2 6 5 23 24 28 27) (32 8 1) simpleGrading (1 1 1)
    hex (2 3 7 6 24 25 29 28) (150 8 1) simpleGrading (7 1 1)
    hex (6 7 11 10 28 29 33 32) (150 32 1) simpleGrading (7 0.2 1)
    hex (10 11 13 12 32 33 35 34) (150 40 1) simpleGrading (7 1 1)
    hex (12 13 17 16 34 35 39 38) (150 32 1) simpleGrading (7 5 1)
    hex (16 17 21 20 38 39 43 42) (150 8 1) simpleGrading (7 1 1)
    hex (15 16 20 19 37 38 42 41) (32 8 1) simpleGrading (1 1 1)
    hex (9 12 16 15 31 34 38 37) (32 32 1) simpleGrading (1 5 1)
    hex (8 9 15 14 30 31 37 36) (32 32 1) simpleGrading (0.2 5 1)
    hex (14 15 19 18 36 37 41 40) (32 8 1) simpleGrading (0.2 1 1)
);


edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 22 26 4)
            (4 26 30 8)
            (8 30 36 14)
            (14 36 40 18)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 29 25)
            (7 11 33 29)
            (11 13 35 33)
            (13 17 39 35)
            (17 21 43 39)
        );
    }
    bottomWall
    {
        type patch;
        faces
        (
            (0 1 23 22)
            (1 2 24 23)
            (2 3 25 24)
        );
    }
    topWall
    {
        type patch;
        faces
        (
            (18 40 41 19)
            (19 41 42 20)
            (20 42 43 21)
        );
    }
    prismWall
    {
        type wall;
        faces
        (
            (12 10 32 34)
            (12 34 31 9)
            (9 31 32 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
